
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002b35 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002b39)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1")
                DW_AT_signature	(0x00000004)

0x0000003f:     DW_TAG_member
                  DW_AT_name	("x")
                  DW_AT_type	(0x0000097d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x0000004a:     DW_TAG_member
                  DW_AT_name	("y")
                  DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                  DW_AT_data_member_location	(0x00000004)

0x00000055:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#get:x")

0x00000086:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x00000094:       NULL

0x00000095:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#set:x")

0x000000c6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000000d4:       DW_TAG_formal_parameter
                    DW_AT_name	("x")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000000df:       NULL

0x000000e0:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#get:y")

0x00000111:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x0000011f:       NULL

0x00000120:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#set:y")

0x00000151:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x0000015f:       DW_TAG_formal_parameter
                    DW_AT_name	("y")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000001)

0x0000016a:       NULL

0x0000016b:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#constructor")

0x000001a2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000001b0:       NULL

0x000001b1:     NULL

0x000001b2:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                DW_AT_signature	(0x00000006)

0x000001e6:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x0000097d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x000001f1:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x0000097d "~lib/number/I32")

0x000001f6:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#get:a")

0x0000022c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001b2 "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x0000023a:       NULL

0x0000023b:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#set:a")

0x00000271:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001b2 "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x0000027f:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x0000028a:       NULL

0x0000028b:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#constructor")

0x000002c7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001b2 "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x000002d5:       NULL

0x000002d6:     NULL

0x000002d7:   DW_TAG_class_type
                DW_AT_name	("~lib/array/Array<i32>")
                DW_AT_signature	(0x00000005)

0x000002f2:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000661 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000302:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000a05 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000315:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x0000097d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x00000329:     DW_TAG_member
                  DW_AT_name	("length_")
                  DW_AT_type	(0x0000097d "~lib/number/I32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000033a:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x0000097d "~lib/number/I32")

0x0000033f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:buffer")

0x00000361:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000036f:       NULL

0x00000370:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:buffer")

0x00000392:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000003a0:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x00000661 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000003b0:       NULL

0x000003b1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:dataStart")

0x000003d6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000003e4:       NULL

0x000003e5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:dataStart")

0x0000040a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000418:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000a05 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x0000042b:       NULL

0x0000042c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:byteLength")

0x00000452:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000460:       NULL

0x00000461:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:byteLength")

0x00000487:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000495:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000004a9:       NULL

0x000004aa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:length_")

0x000004cd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000004db:       NULL

0x000004dc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:length_")

0x000004ff:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000050d:       DW_TAG_formal_parameter
                    DW_AT_name	("length_")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x0000051e:       NULL

0x0000051f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#constructor")

0x00000542:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000550:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000560:       NULL

0x00000561:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__get")

0x0000057e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000058c:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x0000059b:       NULL

0x0000059c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__uget")

0x000005ba:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000005c8:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000005d7:       NULL

0x000005d8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__set")

0x000005f5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000603:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000612:       DW_TAG_formal_parameter
                    DW_AT_name	("value")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x00000621:       NULL

0x00000622:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__visit")

0x00000641:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d7 "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000064f:       DW_TAG_formal_parameter
                    DW_AT_name	("cookie")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x0000065f:       NULL

0x00000660:     NULL

0x00000661:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000683:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000006ad:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000661 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x000006bb:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000006cb:       NULL

0x000006cc:     NULL

0x000006cd:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000006f3:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000661 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000703:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000a05 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000716:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x0000097d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x0000072a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x00000757:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000765:       NULL

0x00000766:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000793:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000007a1:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x00000661 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000007b1:       NULL

0x000007b2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000007e2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000007f0:       NULL

0x000007f1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x00000821:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000082f:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000a05 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000842:       NULL

0x00000843:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000874:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000882:       NULL

0x00000883:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x000008b4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000008c2:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000008d6:       NULL

0x000008d7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000905:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006cd "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000913:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000923:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x00000936:       NULL

0x00000937:     NULL

0x00000938:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")

0x0000094a:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")

0x0000095b:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")

0x0000096c:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")

0x0000097d:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")

0x0000098e:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")

0x0000099f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")

0x000009af:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")

0x000009c2:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")

0x000009d3:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")

0x000009e4:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")

0x000009f5:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")

0x00000a05:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")

0x00000a18:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000a30:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x00000a50:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a18 "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x00000a5e:       NULL

0x00000a5f:     NULL

0x00000a60:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x00000a7a:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000a05 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000a8a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x00000aab:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a60 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000ab9:       NULL

0x00000aba:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x00000adb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a60 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000ae9:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x00000a05 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000af9:       NULL

0x00000afa:     NULL

0x00000afb:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000b16:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x000009d3 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x00000b26:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x000009d3 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x00000b37:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x000009d3 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000b45:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x000009d3 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x00000b55:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x00000b77:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000b85:       NULL

0x00000b86:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000ba8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000bb6:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000bc6:       NULL

0x00000bc7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x00000bea:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000bf8:       NULL

0x00000bf9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000c1c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c2a:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000c3b:       NULL

0x00000c3c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000c5c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c6a:       NULL

0x00000c6b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000c8b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c99:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000ca7:       NULL

0x00000ca8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x00000cca:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000cd8:       NULL

0x00000cd9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000cfb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000afb "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000d09:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000d19:       NULL

0x00000d1a:     NULL

0x00000d1b:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x00000d35:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000a05 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000d4c:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000d5a:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x000009d3 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000d68:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x000009d3 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x00000d78:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000da0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000dae:       NULL

0x00000daf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000dd7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000de5:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x00000a05 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000dfc:       NULL

0x00000dfd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000e1c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e2a:       NULL

0x00000e2b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000e4a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e58:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000e66:       NULL

0x00000e67:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000e86:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e94:       NULL

0x00000e95:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000eb4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ec2:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000ed0:       NULL

0x00000ed1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000ef2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f00:       NULL

0x00000f01:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000f22:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f30:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x000009d3 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000f40:       NULL

0x00000f41:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000f60:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f6e:       NULL

0x00000f6f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000f8e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f9c:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000fa9:       NULL

0x00000faa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000fca:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000fd8:       NULL

0x00000fd9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000ff9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001007:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00001016:       NULL

0x00001017:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00001036:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001044:       NULL

0x00001045:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00001062:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001070:       NULL

0x00001071:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x0000108e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000109c:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000010aa:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x000010bd:       NULL

0x000010be:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x000010e6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000010f4:       NULL

0x000010f5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00001114:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d1b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001122:       NULL

0x00001123:     NULL

0x00001124:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x0000113c:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x0000114a:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00001158:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00001175:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00001183:       NULL

0x00001184:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x000011a1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x000011af:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x000011bd:       NULL

0x000011be:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x000011db:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x000011e9:       NULL

0x000011ea:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00001207:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00001215:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00001124 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00001223:       NULL

0x00001224:     NULL

0x00001225:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x0000123c:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000a05 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000124b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00001268:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001225 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00001276:       NULL

0x00001277:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00001294:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001225 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x000012a2:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x00000a05 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x000012b1:       NULL

0x000012b2:     NULL

0x000012b3:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x000012d6:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x0000097d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x000012e5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x0000130e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000012b3 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x0000131c:       NULL

0x0000131d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00001346:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000012b3 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00001354:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00001363:       NULL

0x00001364:     NULL

0x00001365:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x0000137d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00001398:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001365 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x000013a6:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x0000097d "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000013b3:       NULL

0x000013b4:     NULL

0x000013b5:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x0000097d "~lib/number/I32")

0x000013db:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x000009d3 "~lib/number/U32")

0x000013f7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x00001413:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x0000142f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x00001451:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x00001474:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000938 "~lib/number/Bool")

0x0000148e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x000014b1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x000014d5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000938 "~lib/number/Bool")

0x000014f1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000938 "~lib/number/Bool")

0x0000150c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x0000152f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000938 "~lib/number/Bool")

0x00001549:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x0000097d "~lib/number/I32")

0x00001567:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x00001586:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x00000a05 "~lib/number/Usize")

0x000015a4:   DW_TAG_variable
