
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x000024bf version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000024c3)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestGlobal/C1")
                DW_AT_signature	(0x00000004)

0x00000035:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000410 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000040:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestGlobal/C1#get:a")

0x00000067:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestGlobal/C1")
                    DW_AT_location	(0x00000000)

0x00000075:       NULL

0x00000076:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestGlobal/C1#set:a")

0x0000009d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestGlobal/C1")
                    DW_AT_location	(0x00000000)

0x000000ab:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000000b6:       NULL

0x000000b7:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestGlobal/C1#constructor")

0x000000e4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestGlobal/C1")
                    DW_AT_location	(0x00000000)

0x000000f2:       NULL

0x000000f3:     NULL

0x000000f4:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000116:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x00000140:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000f4 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x0000014e:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x0000015e:       NULL

0x0000015f:     NULL

0x00000160:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x00000186:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000000f4 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000196:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000498 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x000001a9:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000410 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x000001bd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x000001ea:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000001f8:       NULL

0x000001f9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000226:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000234:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000000f4 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x00000244:       NULL

0x00000245:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x00000275:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000283:       NULL

0x00000284:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000002b4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000002c2:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000498 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x000002d5:       NULL

0x000002d6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000307:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000315:       NULL

0x00000316:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000347:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000355:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000369:       NULL

0x0000036a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000398:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000160 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003a6:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000003b6:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x000003c9:       NULL

0x000003ca:     NULL

0x000003cb:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")

0x000003dd:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")

0x000003ee:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")

0x000003ff:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")

0x00000410:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")

0x00000421:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")

0x00000432:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")

0x00000442:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")

0x00000455:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")

0x00000466:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")

0x00000477:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")

0x00000488:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")

0x00000498:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")

0x000004ab:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000004c3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x000004e3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004ab "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x000004f1:       NULL

0x000004f2:     NULL

0x000004f3:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x0000050d:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000498 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000051d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x0000053e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f3 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000054c:       NULL

0x0000054d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x0000056e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f3 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000057c:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x00000498 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x0000058c:       NULL

0x0000058d:     NULL

0x0000058e:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x000005a9:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000466 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x000005b9:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000466 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x000005ca:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000466 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x000005d8:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000466 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x000005e8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x0000060a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000618:       NULL

0x00000619:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x0000063b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000649:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x00000466 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000659:       NULL

0x0000065a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x0000067d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000068b:       NULL

0x0000068c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x000006af:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006bd:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x00000466 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x000006ce:       NULL

0x000006cf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x000006ef:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006fd:       NULL

0x000006fe:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x0000071e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000072c:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000466 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x0000073a:       NULL

0x0000073b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x0000075d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000076b:       NULL

0x0000076c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x0000078e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000058e "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000079c:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000466 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x000007ac:       NULL

0x000007ad:     NULL

0x000007ae:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x000007c8:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000498 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x000007df:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000007ed:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000466 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x000007fb:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000466 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000080b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000833:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000841:       NULL

0x00000842:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x0000086a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000878:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x00000498 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x0000088f:       NULL

0x00000890:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x000008af:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000008bd:       NULL

0x000008be:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x000008dd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000008eb:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000008f9:       NULL

0x000008fa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000919:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000927:       NULL

0x00000928:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000947:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000955:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000466 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000963:       NULL

0x00000964:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000985:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000993:       NULL

0x00000994:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x000009b5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009c3:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000466 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x000009d3:       NULL

0x000009d4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x000009f3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a01:       NULL

0x00000a02:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000a21:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a2f:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000a3c:       NULL

0x00000a3d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000a5d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a6b:       NULL

0x00000a6c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000a8c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a9a:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000aa9:       NULL

0x00000aaa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000ac9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ad7:       NULL

0x00000ad8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000af5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b03:       NULL

0x00000b04:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000b21:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b2f:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000b3d:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x00000b50:       NULL

0x00000b51:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000b79:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b87:       NULL

0x00000b88:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000ba7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000007ae "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bb5:       NULL

0x00000bb6:     NULL

0x00000bb7:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000bcf:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000bdd:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000beb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000c08:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000c16:       NULL

0x00000c17:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000c34:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000c42:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000c50:       NULL

0x00000c51:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000c6e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000c7c:       NULL

0x00000c7d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000c9a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000ca8:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000bb7 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000cb6:       NULL

0x00000cb7:     NULL

0x00000cb8:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000ccf:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000498 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000cde:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000cfb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000cb8 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000d09:       NULL

0x00000d0a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000d27:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000cb8 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000d35:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x00000498 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000d44:       NULL

0x00000d45:     NULL

0x00000d46:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000d69:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000410 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000d78:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000da1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d46 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000daf:       NULL

0x00000db0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000dd9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d46 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000de7:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000df6:       NULL

0x00000df7:     NULL

0x00000df8:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000e10:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000e2b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000df8 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000e39:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000410 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000e46:       NULL

0x00000e47:     NULL

0x00000e48:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestGlobal/b")
                DW_AT_type	(0x00000410 "~lib/number/I32")

0x00000e6c:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestGlobal/c1")
                DW_AT_type	(0x00000010 "tests/DebugSymbol/TestGlobal/C1")

0x00000e91:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000410 "~lib/number/I32")

0x00000eb7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000466 "~lib/number/U32")

0x00000ed3:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x00000eef:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x00000f0b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x00000f2d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x00000f50:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x000003cb "~lib/number/Bool")

0x00000f6a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x00000f8d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x00000fb1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x000003cb "~lib/number/Bool")

0x00000fcd:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x000003cb "~lib/number/Bool")

0x00000fe8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000498 "~lib/number/Usize")

0x0000100b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x000003cb "~lib/number/Bool")

0x00001025:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000410 "~lib/number/I32")

