
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002679 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000267d)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>")
                DW_AT_signature	(0x00000004)

0x00000041:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x000005fe "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x0000004c:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x000005fe "~lib/number/I32")

0x00000051:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#get:a")

0x00000084:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x00000092:       NULL

0x00000093:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#set:a")

0x000000c6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x000000d4:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000000df:       NULL

0x000000e0:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#constructor")

0x00000119:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x00000127:       NULL

0x00000128:     NULL

0x00000129:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                DW_AT_signature	(0x00000005)

0x00000182:     DW_TAG_member
                  DW_AT_name	("b")
                  DW_AT_type	(0x00000010 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                  DW_AT_data_member_location	(0x00000000)

0x0000018d:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000010 "tests/DebugSymbol/TestTemplateClass/C2<i32>")

0x00000192:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#get:b")

0x000001ed:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000129 "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x000001fb:       NULL

0x000001fc:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#set:b")

0x00000257:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000129 "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x00000265:       DW_TAG_formal_parameter
                    DW_AT_name	("b")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000001)

0x00000270:       NULL

0x00000271:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#constructor")

0x000002d2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000129 "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x000002e0:       NULL

0x000002e1:     NULL

0x000002e2:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000304:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x0000032e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002e2 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x0000033c:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x0000034c:       NULL

0x0000034d:     NULL

0x0000034e:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x00000374:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000002e2 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000384:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000686 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000397:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x000005fe "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x000003ab:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x000003d8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003e6:       NULL

0x000003e7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000414:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000422:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000002e2 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x00000432:       NULL

0x00000433:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x00000463:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000471:       NULL

0x00000472:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000004a2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004b0:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000686 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x000004c3:       NULL

0x000004c4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x000004f5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000503:       NULL

0x00000504:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000535:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000543:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000557:       NULL

0x00000558:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000586:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000034e "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000594:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000005a4:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x000005b7:       NULL

0x000005b8:     NULL

0x000005b9:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")

0x000005cb:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")

0x000005dc:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")

0x000005ed:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")

0x000005fe:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")

0x0000060f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")

0x00000620:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")

0x00000630:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")

0x00000643:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")

0x00000654:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")

0x00000665:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")

0x00000676:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")

0x00000686:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")

0x00000699:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000006b1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x000006d1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000699 "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x000006df:       NULL

0x000006e0:     NULL

0x000006e1:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x000006fb:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000686 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000070b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x0000072c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e1 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000073a:       NULL

0x0000073b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x0000075c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e1 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000076a:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x00000686 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x0000077a:       NULL

0x0000077b:     NULL

0x0000077c:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000797:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000654 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x000007a7:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000654 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x000007b8:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000654 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x000007c6:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000654 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x000007d6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x000007f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000806:       NULL

0x00000807:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000829:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000837:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x00000654 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000847:       NULL

0x00000848:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x0000086b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000879:       NULL

0x0000087a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x0000089d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008ab:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x00000654 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x000008bc:       NULL

0x000008bd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x000008dd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008eb:       NULL

0x000008ec:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x0000090c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000091a:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000654 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000928:       NULL

0x00000929:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x0000094b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000959:       NULL

0x0000095a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x0000097c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000077c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000098a:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000654 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x0000099a:       NULL

0x0000099b:     NULL

0x0000099c:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x000009b6:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000686 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x000009cd:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000009db:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000654 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x000009e9:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000654 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x000009f9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000a21:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a2f:       NULL

0x00000a30:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000a58:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a66:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x00000686 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000a7d:       NULL

0x00000a7e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000a9d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000aab:       NULL

0x00000aac:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000acb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ad9:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000ae7:       NULL

0x00000ae8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000b07:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b15:       NULL

0x00000b16:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000b35:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b43:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000654 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000b51:       NULL

0x00000b52:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000b73:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b81:       NULL

0x00000b82:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000ba3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bb1:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000654 "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000bc1:       NULL

0x00000bc2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000be1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bef:       NULL

0x00000bf0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000c0f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c1d:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000c2a:       NULL

0x00000c2b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000c4b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c59:       NULL

0x00000c5a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000c7a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c88:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000c97:       NULL

0x00000c98:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000cb7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cc5:       NULL

0x00000cc6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000ce3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cf1:       NULL

0x00000cf2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000d0f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d1d:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000d2b:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x00000d3e:       NULL

0x00000d3f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000d67:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d75:       NULL

0x00000d76:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000d95:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000099c "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000da3:       NULL

0x00000da4:     NULL

0x00000da5:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000dbd:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000dcb:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000dd9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000df6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e04:       NULL

0x00000e05:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000e22:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e30:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000e3e:       NULL

0x00000e3f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000e5c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e6a:       NULL

0x00000e6b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000e88:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e96:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000da5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000ea4:       NULL

0x00000ea5:     NULL

0x00000ea6:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000ebd:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000686 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000ecc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000ee9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ea6 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000ef7:       NULL

0x00000ef8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000f15:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ea6 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000f23:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x00000686 "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000f32:       NULL

0x00000f33:     NULL

0x00000f34:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000f57:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x000005fe "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000f66:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000f8f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f34 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000f9d:       NULL

0x00000f9e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000fc7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f34 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000fd5:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000fe4:       NULL

0x00000fe5:     NULL

0x00000fe6:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000ffe:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00001019:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000fe6 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00001027:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x000005fe "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00001034:       NULL

0x00001035:     NULL

0x00001036:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x000005fe "~lib/number/I32")

0x0000105c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000654 "~lib/number/U32")

0x00001078:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x00001094:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x000010b0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x000010d2:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x000010f5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x000005b9 "~lib/number/Bool")

0x0000110f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x00001132:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x00001156:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x000005b9 "~lib/number/Bool")

0x00001172:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x000005b9 "~lib/number/Bool")

0x0000118d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x000011b0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x000005b9 "~lib/number/Bool")

0x000011ca:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x000005fe "~lib/number/I32")

0x000011e8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x00001207:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x00000686 "~lib/number/Usize")

0x00001225:   DW_TAG_variable
