
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4


.debug_info contents:
0x00000000: Compile Unit: length = 0x00000a90 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000a94)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                DW_AT_signature	(0x00000005)

0x00000069:     DW_TAG_member
                  DW_AT_name	("b")
                  DW_AT_type	(0x0000013d "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                  DW_AT_data_member_location	(0x00000000)

0x00000074:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x0000013d "tests/DebugSymbol/TestTemplateClass/C2<i32>")

0x00000079:     NULL

0x0000007a:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000092:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x0000007a "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x000000a0:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x0000007a "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x000000ae:     NULL

0x000000af:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x000000d2:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x000003a0 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x000000e1:     NULL

0x000000e2:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x000000fd:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000364 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x0000010d:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000364 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x0000011e:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000364 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000012c:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000364 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000013c:     NULL

0x0000013d:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>")
                DW_AT_signature	(0x00000004)

0x0000016e:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x000003a0 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000179:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x000003a0 "~lib/number/I32")

0x0000017e:     NULL

0x0000017f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")

0x00000190:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")

0x000001a3:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000001bb:     NULL

0x000001bc:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x000001de:     NULL

0x000001df:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x000001f6:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000190 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000205:     NULL

0x00000206:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")

0x00000217:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")

0x00000228:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000240:     NULL

0x00000241:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x0000025b:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000190 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000272:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000280:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000364 "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000028e:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000364 "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000029e:     NULL

0x0000029f:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000002c5:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000001bc "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000002d5:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000190 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x000002e8:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x000003a0 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x000002fc:     NULL

0x000002fd:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")

0x0000030f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")

0x0000031f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")

0x00000330:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")

0x00000340:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")

0x00000351:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")

0x00000364:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")

0x00000375:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x0000038f:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000190 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000039f:     NULL

0x000003a0:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")

0x000003b1:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")

0x000003c2:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000003e8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_END")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000401:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_START")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000041c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/LEFTFREE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000437:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/FREE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000044e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/TAGS_MASK")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000046a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/FL_BITS")
                DW_AT_type	(0x00000364 "~lib/number/U32")

0x00000484:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SB_BITS")
                DW_AT_type	(0x00000364 "~lib/number/U32")

0x0000049e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_SIZE")
                DW_AT_type	(0x00000364 "~lib/number/U32")

0x000004b8:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/SIGN_BIAS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000004d6:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/POW_LOG_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000004fd:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOG2_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000521:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/ROOT")
                DW_AT_type	(0x000001df "~lib/rt/tlsf/Root")

0x00000538:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/HL_END")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000551:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOGF_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000575:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOG2F_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x0000059a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/white")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000005b3:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/EXP2F_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000005d8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000364 "~lib/number/U32")

0x000005f4:   DW_TAG_variable
                DW_AT_name	("~lib/util/error/E_INDEXOUTOFRANGE")
                DW_AT_type	(0x00000228 "~lib/string/String")

0x0000061b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/pinSpace")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x00000637:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000065a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000676:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_BITS")
                DW_AT_type	(0x00000364 "~lib/number/U32")

0x00000690:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/transparent")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000006af:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x000006d1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x000002fd "~lib/number/Bool")

0x000006ec:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/gray")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000704:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SB_SIZE")
                DW_AT_type	(0x00000364 "~lib/number/U32")

0x0000071e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x000002fd "~lib/number/Bool")

0x00000738:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000075b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000077e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x0000079c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x000007c0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/HL_START")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x000007db:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x000002fd "~lib/number/Bool")

0x000007f7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000813:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x000002fd "~lib/number/Bool")

0x0000082d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_SWEEP")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x0000084c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x0000086a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/ROOT_SIZE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000886:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_MARK")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000008a4:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/EXP_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x000008c7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/toSpace")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x000008e2:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/VISIT_SCAN")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000900:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/fromSpace")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x0000091d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000093c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x0000095a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STEPFACTOR")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000978:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOG_TABLE_BITS")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x0000099b:   DW_TAG_variable
                DW_AT_name	("~lib/util/error/E_ALLOCATION_TOO_LARGE")
                DW_AT_type	(0x00000228 "~lib/string/String")

0x000009c7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/total")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x000009e0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/threshold")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x000009fd:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/BLOCK_MINSIZE")
                DW_AT_type	(0x00000190 "~lib/number/Usize")

0x00000a1d:   DW_TAG_variable
                DW_AT_name	("~lib/util/number/MAX_DOUBLE_LENGTH")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000a45:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/state")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000a5e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/visitCount")
                DW_AT_type	(0x000003a0 "~lib/number/I32")

0x00000a7c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/iter")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

.debug_str contents:
0x00000000: "warpo"
