
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002825 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002829)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator")
                DW_AT_signature	(0x00000004)

0x00000048:     DW_TAG_member
                  DW_AT_name	("value")
                  DW_AT_type	(0x00000586 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000057:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#get:value")

0x00000095:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000000a3:       NULL

0x000000a4:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#set:value")

0x000000e2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000000f0:       DW_TAG_formal_parameter
                    DW_AT_name	("value")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000000ff:       NULL

0x00000100:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#constructor")

0x00000140:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x0000014e:       NULL

0x0000014f:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#add")

0x00000187:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000195:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000001a0:       DW_TAG_formal_parameter
                    DW_AT_name	("b")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x000001ab:       NULL

0x000001ac:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#processNullable")

0x000001f0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000001fe:       DW_TAG_formal_parameter
                    DW_AT_name	("input")
                    DW_AT_type	(0x00000f6e "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x0000020d:       NULL

0x0000020e:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#getLength")

0x0000024c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000010 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x0000025a:       DW_TAG_formal_parameter
                    DW_AT_name	("text")
                    DW_AT_type	(0x00000f6e "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x00000268:       NULL

0x00000269:     NULL

0x0000026a:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x0000028c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000002b6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000026a "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x000002c4:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000002d4:       NULL

0x000002d5:     NULL

0x000002d6:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000002fc:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x0000026a "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x0000030c:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000060e "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x0000031f:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000586 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x00000333:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x00000360:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000036e:       NULL

0x0000036f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x0000039c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003aa:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x0000026a "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000003ba:       NULL

0x000003bb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000003eb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003f9:       NULL

0x000003fa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x0000042a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000438:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000060e "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x0000044b:       NULL

0x0000044c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x0000047d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000048b:       NULL

0x0000048c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x000004bd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004cb:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x000004df:       NULL

0x000004e0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x0000050e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002d6 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000051c:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x0000052c:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x0000053f:       NULL

0x00000540:     NULL

0x00000541:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")

0x00000553:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")

0x00000564:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")

0x00000575:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")

0x00000586:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")

0x00000597:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")

0x000005a8:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")

0x000005b8:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")

0x000005cb:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")

0x000005dc:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")

0x000005ed:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")

0x000005fe:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")

0x0000060e:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")

0x00000621:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000639:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x00000659:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000621 "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x00000667:       NULL

0x00000668:     NULL

0x00000669:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x00000683:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000060e "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000693:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x000006b4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000669 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000006c2:       NULL

0x000006c3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x000006e4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000669 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000006f2:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000060e "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000702:       NULL

0x00000703:     NULL

0x00000704:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x0000071f:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x000005dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x0000072f:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x000005dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x00000740:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x000005dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000074e:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x000005dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000075e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x00000780:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000078e:       NULL

0x0000078f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x000007b1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000007bf:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x000005dc "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x000007cf:       NULL

0x000007d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x000007f3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000801:       NULL

0x00000802:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000825:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000833:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x000005dc "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000844:       NULL

0x00000845:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000865:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000873:       NULL

0x00000874:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000894:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008a2:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x000005dc "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x000008b0:       NULL

0x000008b1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x000008d3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008e1:       NULL

0x000008e2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000904:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000704 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000912:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x000005dc "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000922:       NULL

0x00000923:     NULL

0x00000924:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x0000093e:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000060e "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000955:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000963:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x000005dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000971:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x000005dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x00000981:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x000009a9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009b7:       NULL

0x000009b8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x000009e0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009ee:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000060e "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000a05:       NULL

0x00000a06:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000a25:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a33:       NULL

0x00000a34:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000a53:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a61:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000a6f:       NULL

0x00000a70:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000a8f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a9d:       NULL

0x00000a9e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000abd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000acb:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x000005dc "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000ad9:       NULL

0x00000ada:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000afb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b09:       NULL

0x00000b0a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000b2b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b39:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x000005dc "~lib/number/U32")
                    DW_AT_location	(0x00000001)

0x00000b49:       NULL

0x00000b4a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000b69:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b77:       NULL

0x00000b78:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000b97:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ba5:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000bb2:       NULL

0x00000bb3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000bd3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000be1:       NULL

0x00000be2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000c02:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c10:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000c1f:       NULL

0x00000c20:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000c3f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c4d:       NULL

0x00000c4e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000c6b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c79:       NULL

0x00000c7a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000c97:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ca5:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000cb3:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000002)

0x00000cc6:       NULL

0x00000cc7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000cef:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cfd:       NULL

0x00000cfe:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000d1d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000924 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d2b:       NULL

0x00000d2c:     NULL

0x00000d2d:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000d45:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000d53:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000d61:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000d7e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d8c:       NULL

0x00000d8d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000daa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000db8:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000dc6:       NULL

0x00000dc7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000de4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000df2:       NULL

0x00000df3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000e10:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e1e:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000d2d "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000e2c:       NULL

0x00000e2d:     NULL

0x00000e2e:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000e45:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000060e "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000e54:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000e71:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e2e "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000e7f:       NULL

0x00000e80:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000e9d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e2e "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000eab:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000060e "~lib/number/Usize")
                    DW_AT_location	(0x00000001)

0x00000eba:       NULL

0x00000ebb:     NULL

0x00000ebc:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000edf:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000586 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000eee:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000f17:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ebc "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000f25:       NULL

0x00000f26:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000f4f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ebc "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000f5d:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000f6c:       NULL

0x00000f6d:     NULL

0x00000f6e:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000f86:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000fa1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f6e "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000faf:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000586 "~lib/number/I32")
                    DW_AT_location	(0x00000001)

0x00000fbc:       NULL

0x00000fbd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#get:length")

0x00000fdc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f6e "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000fea:       NULL

0x00000feb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#concat")

0x00001006:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f6e "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00001014:       DW_TAG_formal_parameter
                    DW_AT_name	("other")
                    DW_AT_type	(0x00000f6e "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x00001023:       NULL

0x00001024:     NULL

0x00001025:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000586 "~lib/number/I32")

0x0000104b:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_SHRINK_LEVEL")
                DW_AT_type	(0x00000586 "~lib/number/I32")

0x0000106d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x000005dc "~lib/number/U32")

0x00001089:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000060e "~lib/number/Usize")

0x000010a5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000060e "~lib/number/Usize")

0x000010c1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000060e "~lib/number/Usize")

0x000010e3:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000060e "~lib/number/Usize")

0x00001106:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000541 "~lib/number/Bool")

0x00001120:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000060e "~lib/number/Usize")

0x00001143:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000060e "~lib/number/Usize")

0x00001167:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
