
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_byte_size	DW_FORM_data4
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_byte_size	DW_FORM_data1


.debug_info contents:
0x00000000: Compile Unit: length = 0x0000043d version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000441)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000006)

0x00000048:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x0000041d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000053:     NULL

0x00000054:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x00000070:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000054 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x0000007e:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000054 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x0000008c:     NULL

0x0000008d:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x000000b4:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x0000041d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x000000c3:     NULL

0x000000c4:   DW_TAG_class_type
                DW_AT_name	("~lib/array/Array<i32>")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000005)

0x000000e3:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000218 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000000f3:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x000001e7 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000106:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x0000041d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x0000011a:     DW_TAG_member
                  DW_AT_name	("length_")
                  DW_AT_type	(0x0000041d "~lib/number/I32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000012b:     NULL

0x0000012c:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x0000014b:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x000003dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x0000015b:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x000003dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x0000016c:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x000003dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000017a:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x000003dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000018a:     NULL

0x0000018b:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000004)

0x000001be:     DW_TAG_member
                  DW_AT_name	("x")
                  DW_AT_type	(0x0000041d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x000001c9:     DW_TAG_member
                  DW_AT_name	("y")
                  DW_AT_type	(0x000000c4 "~lib/array/Array<i32>")
                  DW_AT_data_member_location	(0x00000004)

0x000001d4:     NULL

0x000001d5:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")
                DW_AT_byte_size	(0x04)

0x000001e7:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")
                DW_AT_byte_size	(0x04)

0x000001fb:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x00000217:     NULL

0x00000218:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000001)

0x0000023e:     NULL

0x0000023f:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x0000025a:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x000001e7 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000269:     NULL

0x0000026a:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")
                DW_AT_byte_size	(0x04)

0x0000027c:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")
                DW_AT_byte_size	(0x04)

0x0000028e:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000002)

0x000002aa:     NULL

0x000002ab:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x000002c9:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x000001e7 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x000002e0:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x000002ab "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000002ee:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x000003dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x000002fc:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x000003dc "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000030c:     NULL

0x0000030d:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000003)

0x00000337:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000218 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000347:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x000001e7 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x0000035a:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x0000041d "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x0000036e:     NULL

0x0000036f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")
                DW_AT_byte_size	(0x04)

0x00000382:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")
                DW_AT_byte_size	(0x04)

0x00000393:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")
                DW_AT_byte_size	(0x04)

0x000003a5:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")
                DW_AT_byte_size	(0x04)

0x000003b6:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")
                DW_AT_byte_size	(0x04)

0x000003c8:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")
                DW_AT_byte_size	(0x04)

0x000003dc:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")
                DW_AT_byte_size	(0x04)

0x000003ee:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_byte_size	(0x00000004)
                DW_AT_signature	(0x00000000)

0x0000040c:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x000001e7 "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000041c:     NULL

0x0000041d:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")
                DW_AT_byte_size	(0x04)

0x0000042f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")
                DW_AT_byte_size	(0x04)

.debug_str contents:
0x00000000: "warpo"
